MikroElektronika/core_packages/PIC/XC8/def/PIC16F18857/mcu.h
extern volatile __bit                   SMT1TMR1            __at(0x2461);	// @ (0x48C * 8 + 1)
#define                                 SMT1TMR1_bit        _BIT_ACCESS(SMT1TMRL,1)
// SMT1TMRH<SMT1TMR10>
extern volatile __bit                   SMT1TMR10           __at(0x246A);	// @ (0x48D * 8 + 2)
#define                                 SMT1TMR10_bit       _BIT_ACCESS(SMT1TMRH,2)
// SMT1TMRH<SMT1TMR11>
extern volatile __bit                   SMT1TMR11           __at(0x246B);	// @ (0x48D * 8 + 3)
#define                                 SMT1TMR11_bit       _BIT_ACCESS(SMT1TMRH,3)
// SMT1TMRH<SMT1TMR12>
extern volatile __bit                   SMT1TMR12           __at(0x246C);	// @ (0x48D * 8 + 4)
#define                                 SMT1TMR12_bit       _BIT_ACCESS(SMT1TMRH,4)
// SMT1TMRH<SMT1TMR13>
extern volatile __bit                   SMT1TMR13           __at(0x246D);	// @ (0x48D * 8 + 5)
#define                                 SMT1TMR13_bit       _BIT_ACCESS(SMT1TMRH,5)
// SMT1TMRH<SMT1TMR14>
extern volatile __bit                   SMT1TMR14           __at(0x246E);	// @ (0x48D * 8 + 6)
#define                                 SMT1TMR14_bit       _BIT_ACCESS(SMT1TMRH,6)
// SMT1TMRH<SMT1TMR15>
extern volatile __bit                   SMT1TMR15           __at(0x246F);	// @ (0x48D * 8 + 7)
#define                                 SMT1TMR15_bit       _BIT_ACCESS(SMT1TMRH,7)
// SMT1TMRU<SMT1TMR16>
extern volatile __bit                   SMT1TMR16           __at(0x2470);	// @ (0x48E * 8 + 0)
#define                                 SMT1TMR16_bit       _BIT_ACCESS(SMT1TMRU,0)
// SMT1TMRU<SMT1TMR17>
extern volatile __bit                   SMT1TMR17           __at(0x2471);	// @ (0x48E * 8 + 1)
#define                                 SMT1TMR17_bit       _BIT_ACCESS(SMT1TMRU,1)
// SMT1TMRU<SMT1TMR18>
extern volatile __bit                   SMT1TMR18           __at(0x2472);	// @ (0x48E * 8 + 2)
#define                                 SMT1TMR18_bit       _BIT_ACCESS(SMT1TMRU,2)
// SMT1TMRU<SMT1TMR19>
extern volatile __bit                   SMT1TMR19           __at(0x2473);	// @ (0x48E * 8 + 3)
#define                                 SMT1TMR19_bit       _BIT_ACCESS(SMT1TMRU,3)
// SMT1TMRL<SMT1TMR2>
extern volatile __bit                   SMT1TMR2            __at(0x2462);	// @ (0x48C * 8 + 2)
#define                                 SMT1TMR2_bit        _BIT_ACCESS(SMT1TMRL,2)
// SMT1TMRU<SMT1TMR20>
extern volatile __bit                   SMT1TMR20           __at(0x2474);	// @ (0x48E * 8 + 4)
#define                                 SMT1TMR20_bit       _BIT_ACCESS(SMT1TMRU,4)
// SMT1TMRU<SMT1TMR21>
extern volatile __bit                   SMT1TMR21           __at(0x2475);	// @ (0x48E * 8 + 5)
#define                                 SMT1TMR21_bit       _BIT_ACCESS(SMT1TMRU,5)
// SMT1TMRU<SMT1TMR22>
extern volatile __bit                   SMT1TMR22           __at(0x2476);	// @ (0x48E * 8 + 6)
#define                                 SMT1TMR22_bit       _BIT_ACCESS(SMT1TMRU,6)
// SMT1TMRU<SMT1TMR23>
extern volatile __bit                   SMT1TMR23           __at(0x2477);	// @ (0x48E * 8 + 7)
#define                                 SMT1TMR23_bit       _BIT_ACCESS(SMT1TMRU,7)
// SMT1TMRL<SMT1TMR3>
extern volatile __bit                   SMT1TMR3            __at(0x2463);	// @ (0x48C * 8 + 3)
#define                                 SMT1TMR3_bit        _BIT_ACCESS(SMT1TMRL,3)
// SMT1TMRL<SMT1TMR4>
extern volatile __bit                   SMT1TMR4            __at(0x2464);	// @ (0x48C * 8 + 4)
#define                                 SMT1TMR4_bit        _BIT_ACCESS(SMT1TMRL,4)
// SMT1TMRL<SMT1TMR5>
extern volatile __bit                   SMT1TMR5            __at(0x2465);	// @ (0x48C * 8 + 5)
#define                                 SMT1TMR5_bit        _BIT_ACCESS(SMT1TMRL,5)
// SMT1TMRL<SMT1TMR6>
extern volatile __bit                   SMT1TMR6            __at(0x2466);	// @ (0x48C * 8 + 6)
#define                                 SMT1TMR6_bit        _BIT_ACCESS(SMT1TMRL,6)
// SMT1TMRL<SMT1TMR7>
extern volatile __bit                   SMT1TMR7            __at(0x2467);	// @ (0x48C * 8 + 7)
#define                                 SMT1TMR7_bit        _BIT_ACCESS(SMT1TMRL,7)
// SMT1TMRH<SMT1TMR8>
extern volatile __bit                   SMT1TMR8            __at(0x2468);	// @ (0x48D * 8 + 0)
#define                                 SMT1TMR8_bit        _BIT_ACCESS(SMT1TMRH,0)
// SMT1TMRH<SMT1TMR9>
extern volatile __bit                   SMT1TMR9            __at(0x2469);	// @ (0x48D * 8 + 1)
#define                                 SMT1TMR9_bit        _BIT_ACCESS(SMT1TMRH,1)
// SMT1STAT<SMT1TS>
extern volatile __bit                   SMT1TS              __at(0x24D2);	// @ (0x49A * 8 + 2)
#define                                 SMT1TS_bit          _BIT_ACCESS(SMT1STAT,2)
// SMT1CON0<SMT1WOL>
extern volatile __bit                   SMT1WOL             __at(0x24C4);	// @ (0x498 * 8 + 4)
#define                                 SMT1WOL_bit         _BIT_ACCESS(SMT1CON0,4)
// SMT1STAT<SMT1WS>
extern volatile __bit                   SMT1WS              __at(0x24D1);	// @ (0x49A * 8 + 1)
#define                                 SMT1WS_bit          _BIT_ACCESS(SMT1STAT,1)
// SMT1WIN<SMT1WSEL0>
extern volatile __bit                   SMT1WSEL0           __at(0x24E8);	// @ (0x49D * 8 + 0)
#define                                 SMT1WSEL0_bit       _BIT_ACCESS(SMT1WIN,0)
// SMT1WIN<SMT1WSEL1>
extern volatile __bit                   SMT1WSEL1           __at(0x24E9);	// @ (0x49D * 8 + 1)
#define                                 SMT1WSEL1_bit       _BIT_ACCESS(SMT1WIN,1)
// SMT1WIN<SMT1WSEL2>
extern volatile __bit                   SMT1WSEL2           __at(0x24EA);	// @ (0x49D * 8 + 2)
#define                                 SMT1WSEL2_bit       _BIT_ACCESS(SMT1WIN,2)
// SMT1WIN<SMT1WSEL3>
extern volatile __bit                   SMT1WSEL3           __at(0x24EB);	// @ (0x49D * 8 + 3)
#define                                 SMT1WSEL3_bit       _BIT_ACCESS(SMT1WIN,3)
// SMT1WIN<SMT1WSEL4>
extern volatile __bit                   SMT1WSEL4           __at(0x24EC);	// @ (0x49D * 8 + 4)
#define                                 SMT1WSEL4_bit       _BIT_ACCESS(SMT1WIN,4)
// SMT2STAT<SMT2AS>
extern volatile __bit                   SMT2AS              __at(0x28D0);	// @ (0x51A * 8 + 0)
#define                                 SMT2AS_bit          _BIT_ACCESS(SMT2STAT,0)
// SMT2CON0<SMT2CPOL>
extern volatile __bit                   SMT2CPOL            __at(0x28C2);	// @ (0x518 * 8 + 2)
#define                                 SMT2CPOL_bit        _BIT_ACCESS(SMT2CON0,2)
// SMT2CPRL<SMT2CPR0>
extern volatile __bit                   SMT2CPR0            __at(0x2878);	// @ (0x50F * 8 + 0)
#define                                 SMT2CPR0_bit        _BIT_ACCESS(SMT2CPRL,0)
// SMT2CPRL<SMT2CPR1>
extern volatile __bit                   SMT2CPR1            __at(0x2879);	// @ (0x50F * 8 + 1)
#define                                 SMT2CPR1_bit        _BIT_ACCESS(SMT2CPRL,1)
// SMT2CPRH<SMT2CPR10>
extern volatile __bit                   SMT2CPR10           __at(0x2882);	// @ (0x510 * 8 + 2)
#define                                 SMT2CPR10_bit       _BIT_ACCESS(SMT2CPRH,2)
// SMT2CPRH<SMT2CPR11>
extern volatile __bit                   SMT2CPR11           __at(0x2883);	// @ (0x510 * 8 + 3)
#define                                 SMT2CPR11_bit       _BIT_ACCESS(SMT2CPRH,3)
// SMT2CPRH<SMT2CPR12>
extern volatile __bit                   SMT2CPR12           __at(0x2884);	// @ (0x510 * 8 + 4)
#define                                 SMT2CPR12_bit       _BIT_ACCESS(SMT2CPRH,4)
// SMT2CPRH<SMT2CPR13>
extern volatile __bit                   SMT2CPR13           __at(0x2885);	// @ (0x510 * 8 + 5)
#define                                 SMT2CPR13_bit       _BIT_ACCESS(SMT2CPRH,5)
// SMT2CPRH<SMT2CPR14>
extern volatile __bit                   SMT2CPR14           __at(0x2886);	// @ (0x510 * 8 + 6)
#define                                 SMT2CPR14_bit       _BIT_ACCESS(SMT2CPRH,6)
// SMT2CPRH<SMT2CPR15>
extern volatile __bit                   SMT2CPR15           __at(0x2887);	// @ (0x510 * 8 + 7)
#define                                 SMT2CPR15_bit       _BIT_ACCESS(SMT2CPRH,7)
// SMT2CPRU<SMT2CPR16>
extern volatile __bit                   SMT2CPR16           __at(0x2888);	// @ (0x511 * 8 + 0)
#define                                 SMT2CPR16_bit       _BIT_ACCESS(SMT2CPRU,0)
// SMT2CPRU<SMT2CPR17>
extern volatile __bit                   SMT2CPR17           __at(0x2889);	// @ (0x511 * 8 + 1)
#define                                 SMT2CPR17_bit       _BIT_ACCESS(SMT2CPRU,1)
// SMT2CPRU<SMT2CPR18>
extern volatile __bit                   SMT2CPR18           __at(0x288A);	// @ (0x511 * 8 + 2)
#define                                 SMT2CPR18_bit       _BIT_ACCESS(SMT2CPRU,2)
// SMT2CPRU<SMT2CPR19>
extern volatile __bit                   SMT2CPR19           __at(0x288B);	// @ (0x511 * 8 + 3)
#define                                 SMT2CPR19_bit       _BIT_ACCESS(SMT2CPRU,3)
// SMT2CPRL<SMT2CPR2>
extern volatile __bit                   SMT2CPR2            __at(0x287A);	// @ (0x50F * 8 + 2)
#define                                 SMT2CPR2_bit        _BIT_ACCESS(SMT2CPRL,2)
// SMT2CPRU<SMT2CPR20>
extern volatile __bit                   SMT2CPR20           __at(0x288C);	// @ (0x511 * 8 + 4)
#define                                 SMT2CPR20_bit       _BIT_ACCESS(SMT2CPRU,4)
// SMT2CPRU<SMT2CPR21>
extern volatile __bit                   SMT2CPR21           __at(0x288D);	// @ (0x511 * 8 + 5)
#define                                 SMT2CPR21_bit       _BIT_ACCESS(SMT2CPRU,5)
// SMT2CPRU<SMT2CPR22>
extern volatile __bit                   SMT2CPR22           __at(0x288E);	// @ (0x511 * 8 + 6)
#define                                 SMT2CPR22_bit       _BIT_ACCESS(SMT2CPRU,6)
// SMT2CPRU<SMT2CPR23>
extern volatile __bit                   SMT2CPR23           __at(0x288F);	// @ (0x511 * 8 + 7)
#define                                 SMT2CPR23_bit       _BIT_ACCESS(SMT2CPRU,7)
// SMT2CPRL<SMT2CPR3>
extern volatile __bit                   SMT2CPR3            __at(0x287B);	// @ (0x50F * 8 + 3)
#define                                 SMT2CPR3_bit        _BIT_ACCESS(SMT2CPRL,3)
// SMT2CPRL<SMT2CPR4>
extern volatile __bit                   SMT2CPR4            __at(0x287C);	// @ (0x50F * 8 + 4)
#define                                 SMT2CPR4_bit        _BIT_ACCESS(SMT2CPRL,4)
// SMT2CPRL<SMT2CPR5>
extern volatile __bit                   SMT2CPR5            __at(0x287D);	// @ (0x50F * 8 + 5)
#define                                 SMT2CPR5_bit        _BIT_ACCESS(SMT2CPRL,5)
// SMT2CPRL<SMT2CPR6>
extern volatile __bit                   SMT2CPR6            __at(0x287E);	// @ (0x50F * 8 + 6)
#define                                 SMT2CPR6_bit        _BIT_ACCESS(SMT2CPRL,6)
// SMT2CPRL<SMT2CPR7>
extern volatile __bit                   SMT2CPR7            __at(0x287F);	// @ (0x50F * 8 + 7)
#define                                 SMT2CPR7_bit        _BIT_ACCESS(SMT2CPRL,7)
// SMT2CPRH<SMT2CPR8>
extern volatile __bit                   SMT2CPR8            __at(0x2880);	// @ (0x510 * 8 + 0)
#define                                 SMT2CPR8_bit        _BIT_ACCESS(SMT2CPRH,0)
// SMT2CPRH<SMT2CPR9>
extern volatile __bit                   SMT2CPR9            __at(0x2881);	// @ (0x510 * 8 + 1)
#define                                 SMT2CPR9_bit        _BIT_ACCESS(SMT2CPRH,1)
// SMT2STAT<SMT2CPRUP>
extern volatile __bit                   SMT2CPRUP           __at(0x28D7);	// @ (0x51A * 8 + 7)
#define                                 SMT2CPRUP_bit       _BIT_ACCESS(SMT2STAT,7)
// SMT2CPWL<SMT2CPW0>
extern volatile __bit                   SMT2CPW0            __at(0x2890);	// @ (0x512 * 8 + 0)
#define                                 SMT2CPW0_bit        _BIT_ACCESS(SMT2CPWL,0)
// SMT2CPWL<SMT2CPW1>
extern volatile __bit                   SMT2CPW1            __at(0x2891);	// @ (0x512 * 8 + 1)
#define                                 SMT2CPW1_bit        _BIT_ACCESS(SMT2CPWL,1)
// SMT2CPWH<SMT2CPW10>
extern volatile __bit                   SMT2CPW10           __at(0x289A);	// @ (0x513 * 8 + 2)
#define                                 SMT2CPW10_bit       _BIT_ACCESS(SMT2CPWH,2)
// SMT2CPWH<SMT2CPW11>
extern volatile __bit                   SMT2CPW11           __at(0x289B);	// @ (0x513 * 8 + 3)
#define                                 SMT2CPW11_bit       _BIT_ACCESS(SMT2CPWH,3)
// SMT2CPWH<SMT2CPW12>
extern volatile __bit                   SMT2CPW12           __at(0x289C);	// @ (0x513 * 8 + 4)
#define                                 SMT2CPW12_bit       _BIT_ACCESS(SMT2CPWH,4)
// SMT2CPWH<SMT2CPW13>
extern volatile __bit                   SMT2CPW13           __at(0x289D);	// @ (0x513 * 8 + 5)
#define                                 SMT2CPW13_bit       _BIT_ACCESS(SMT2CPWH,5)
// SMT2CPWH<SMT2CPW14>
extern volatile __bit                   SMT2CPW14           __at(0x289E);	// @ (0x513 * 8 + 6)
#define                                 SMT2CPW14_bit       _BIT_ACCESS(SMT2CPWH,6)
// SMT2CPWH<SMT2CPW15>
extern volatile __bit                   SMT2CPW15           __at(0x289F);	// @ (0x513 * 8 + 7)
#define                                 SMT2CPW15_bit       _BIT_ACCESS(SMT2CPWH,7)
// SMT2CPWU<SMT2CPW16>
extern volatile __bit                   SMT2CPW16           __at(0x28A0);	// @ (0x514 * 8 + 0)
#define                                 SMT2CPW16_bit       _BIT_ACCESS(SMT2CPWU,0)
// SMT2CPWU<SMT2CPW17>
extern volatile __bit                   SMT2CPW17           __at(0x28A1);	// @ (0x514 * 8 + 1)
#define                                 SMT2CPW17_bit       _BIT_ACCESS(SMT2CPWU,1)
// SMT2CPWU<SMT2CPW18>
extern volatile __bit                   SMT2CPW18           __at(0x28A2);	// @ (0x514 * 8 + 2)
#define                                 SMT2CPW18_bit       _BIT_ACCESS(SMT2CPWU,2)
// SMT2CPWU<SMT2CPW19>
extern volatile __bit                   SMT2CPW19           __at(0x28A3);	// @ (0x514 * 8 + 3)
#define                                 SMT2CPW19_bit       _BIT_ACCESS(SMT2CPWU,3)
// SMT2CPWL<SMT2CPW2>
extern volatile __bit                   SMT2CPW2            __at(0x2892);	// @ (0x512 * 8 + 2)
#define                                 SMT2CPW2_bit        _BIT_ACCESS(SMT2CPWL,2)
// SMT2CPWU<SMT2CPW20>
extern volatile __bit                   SMT2CPW20           __at(0x28A4);	// @ (0x514 * 8 + 4)
#define                                 SMT2CPW20_bit       _BIT_ACCESS(SMT2CPWU,4)
// SMT2CPWU<SMT2CPW21>
extern volatile __bit                   SMT2CPW21           __at(0x28A5);	// @ (0x514 * 8 + 5)
#define                                 SMT2CPW21_bit       _BIT_ACCESS(SMT2CPWU,5)
// SMT2CPWU<SMT2CPW22>
extern volatile __bit                   SMT2CPW22           __at(0x28A6);	// @ (0x514 * 8 + 6)
#define                                 SMT2CPW22_bit       _BIT_ACCESS(SMT2CPWU,6)
// SMT2CPWU<SMT2CPW23>
extern volatile __bit                   SMT2CPW23           __at(0x28A7);	// @ (0x514 * 8 + 7)
#define                                 SMT2CPW23_bit       _BIT_ACCESS(SMT2CPWU,7)
// SMT2CPWL<SMT2CPW3>
extern volatile __bit                   SMT2CPW3            __at(0x2893);	// @ (0x512 * 8 + 3)
#define                                 SMT2CPW3_bit        _BIT_ACCESS(SMT2CPWL,3)
// SMT2CPWL<SMT2CPW4>
extern volatile __bit                   SMT2CPW4            __at(0x2894);	// @ (0x512 * 8 + 4)
#define                                 SMT2CPW4_bit        _BIT_ACCESS(SMT2CPWL,4)
// SMT2CPWL<SMT2CPW5>
extern volatile __bit                   SMT2CPW5            __at(0x2895);	// @ (0x512 * 8 + 5)
#define                                 SMT2CPW5_bit        _BIT_ACCESS(SMT2CPWL,5)
// SMT2CPWL<SMT2CPW6>
extern volatile __bit                   SMT2CPW6            __at(0x2896);	// @ (0x512 * 8 + 6)
#define                                 SMT2CPW6_bit        _BIT_ACCESS(SMT2CPWL,6)
// SMT2CPWL<SMT2CPW7>
extern volatile __bit                   SMT2CPW7            __at(0x2897);	// @ (0x512 * 8 + 7)
#define                                 SMT2CPW7_bit        _BIT_ACCESS(SMT2CPWL,7)
// SMT2CPWH<SMT2CPW8>
extern volatile __bit                   SMT2CPW8            __at(0x2898);	// @ (0x513 * 8 + 0)
#define                                 SMT2CPW8_bit        _BIT_ACCESS(SMT2CPWH,0)
// SMT2CPWH<SMT2CPW9>
extern volatile __bit                   SMT2CPW9            __at(0x2899);	// @ (0x513 * 8 + 1)
#define                                 SMT2CPW9_bit        _BIT_ACCESS(SMT2CPWH,1)
// SMT2STAT<SMT2CPWUP>
extern volatile __bit                   SMT2CPWUP           __at(0x28D6);	// @ (0x51A * 8 + 6)
#define                                 SMT2CPWUP_bit       _BIT_ACCESS(SMT2STAT,6)
// SMT2CLK<SMT2CSEL0>
extern volatile __bit                   SMT2CSEL0           __at(0x28D8);	// @ (0x51B * 8 + 0)
#define                                 SMT2CSEL0_bit       _BIT_ACCESS(SMT2CLK,0)
// SMT2CLK<SMT2CSEL1>
extern volatile __bit                   SMT2CSEL1           __at(0x28D9);	// @ (0x51B * 8 + 1)
#define                                 SMT2CSEL1_bit       _BIT_ACCESS(SMT2CLK,1)
// SMT2CLK<SMT2CSEL2>
extern volatile __bit                   SMT2CSEL2           __at(0x28DA);	// @ (0x51B * 8 + 2)
#define                                 SMT2CSEL2_bit       _BIT_ACCESS(SMT2CLK,2)
// SMT2CON0<SMT2EN>
extern volatile __bit                   SMT2EN              __at(0x28C7);	// @ (0x518 * 8 + 7)
#define                                 SMT2EN_bit          _BIT_ACCESS(SMT2CON0,7)
// SMT2CON1<SMT2GO>
extern volatile __bit                   SMT2GO              __at(0x28CF);	// @ (0x519 * 8 + 7)
#define                                 SMT2GO_bit          _BIT_ACCESS(SMT2CON1,7)
// PIE8<SMT2IE>
extern volatile __bit                   SMT2IE              __at(0x38F3);	// @ (0x71E * 8 + 3)
#define                                 SMT2IE_bit          _BIT_ACCESS(PIE8,3)
// PIR8<SMT2IF>
extern volatile __bit                   SMT2IF              __at(0x38A3);	// @ (0x714 * 8 + 3)
#define                                 SMT2IF_bit          _BIT_ACCESS(PIR8,3)
// PMD5<SMT2MD>
extern volatile __bit                   SMT2MD              __at(0x3CDF);	// @ (0x79B * 8 + 7)
#define                                 SMT2MD_bit          _BIT_ACCESS(PMD5,7)
// SMT2PRL<SMT2PR0>
extern volatile __bit                   SMT2PR0             __at(0x28A8);	// @ (0x515 * 8 + 0)
#define                                 SMT2PR0_bit         _BIT_ACCESS(SMT2PRL,0)
// SMT2PRL<SMT2PR1>
extern volatile __bit                   SMT2PR1             __at(0x28A9);	// @ (0x515 * 8 + 1)
#define                                 SMT2PR1_bit         _BIT_ACCESS(SMT2PRL,1)
// SMT2PRH<SMT2PR10>
extern volatile __bit                   SMT2PR10            __at(0x28B2);	// @ (0x516 * 8 + 2)
#define                                 SMT2PR10_bit        _BIT_ACCESS(SMT2PRH,2)
// SMT2PRH<SMT2PR11>
extern volatile __bit                   SMT2PR11            __at(0x28B3);	// @ (0x516 * 8 + 3)
#define                                 SMT2PR11_bit        _BIT_ACCESS(SMT2PRH,3)
// SMT2PRH<SMT2PR12>
extern volatile __bit                   SMT2PR12            __at(0x28B4);	// @ (0x516 * 8 + 4)
#define                                 SMT2PR12_bit        _BIT_ACCESS(SMT2PRH,4)
// SMT2PRH<SMT2PR13>
extern volatile __bit                   SMT2PR13            __at(0x28B5);	// @ (0x516 * 8 + 5)
#define                                 SMT2PR13_bit        _BIT_ACCESS(SMT2PRH,5)
// SMT2PRH<SMT2PR14>
extern volatile __bit                   SMT2PR14            __at(0x28B6);	// @ (0x516 * 8 + 6)
#define                                 SMT2PR14_bit        _BIT_ACCESS(SMT2PRH,6)
// SMT2PRH<SMT2PR15>
extern volatile __bit                   SMT2PR15            __at(0x28B7);	// @ (0x516 * 8 + 7)
#define                                 SMT2PR15_bit        _BIT_ACCESS(SMT2PRH,7)
// SMT2PRU<SMT2PR16>
extern volatile __bit                   SMT2PR16            __at(0x28B8);	// @ (0x517 * 8 + 0)
#define                                 SMT2PR16_bit        _BIT_ACCESS(SMT2PRU,0)
// SMT2PRU<SMT2PR17>
extern volatile __bit                   SMT2PR17            __at(0x28B9);	// @ (0x517 * 8 + 1)
#define                                 SMT2PR17_bit        _BIT_ACCESS(SMT2PRU,1)
// SMT2PRU<SMT2PR18>
extern volatile __bit                   SMT2PR18            __at(0x28BA);	// @ (0x517 * 8 + 2)
#define                                 SMT2PR18_bit        _BIT_ACCESS(SMT2PRU,2)
// SMT2PRU<SMT2PR19>
extern volatile __bit                   SMT2PR19            __at(0x28BB);	// @ (0x517 * 8 + 3)
#define                                 SMT2PR19_bit        _BIT_ACCESS(SMT2PRU,3)
// SMT2PRL<SMT2PR2>
extern volatile __bit                   SMT2PR2             __at(0x28AA);	// @ (0x515 * 8 + 2)
#define                                 SMT2PR2_bit         _BIT_ACCESS(SMT2PRL,2)
// SMT2PRU<SMT2PR20>
extern volatile __bit                   SMT2PR20            __at(0x28BC);	// @ (0x517 * 8 + 4)
#define                                 SMT2PR20_bit        _BIT_ACCESS(SMT2PRU,4)
// SMT2PRU<SMT2PR21>
extern volatile __bit                   SMT2PR21            __at(0x28BD);	// @ (0x517 * 8 + 5)
#define                                 SMT2PR21_bit        _BIT_ACCESS(SMT2PRU,5)
// SMT2PRU<SMT2PR22>
extern volatile __bit                   SMT2PR22            __at(0x28BE);	// @ (0x517 * 8 + 6)
#define                                 SMT2PR22_bit        _BIT_ACCESS(SMT2PRU,6)
// SMT2PRU<SMT2PR23>
extern volatile __bit                   SMT2PR23            __at(0x28BF);	// @ (0x517 * 8 + 7)
#define                                 SMT2PR23_bit        _BIT_ACCESS(SMT2PRU,7)
// SMT2PRL<SMT2PR3>
extern volatile __bit                   SMT2PR3             __at(0x28AB);	// @ (0x515 * 8 + 3)
#define                                 SMT2PR3_bit         _BIT_ACCESS(SMT2PRL,3)
// SMT2PRL<SMT2PR4>
extern volatile __bit                   SMT2PR4             __at(0x28AC);	// @ (0x515 * 8 + 4)
#define                                 SMT2PR4_bit         _BIT_ACCESS(SMT2PRL,4)
// SMT2PRL<SMT2PR5>
extern volatile __bit                   SMT2PR5             __at(0x28AD);	// @ (0x515 * 8 + 5)
#define                                 SMT2PR5_bit         _BIT_ACCESS(SMT2PRL,5)
// SMT2PRL<SMT2PR6>
extern volatile __bit                   SMT2PR6             __at(0x28AE);	// @ (0x515 * 8 + 6)
#define                                 SMT2PR6_bit         _BIT_ACCESS(SMT2PRL,6)
// SMT2PRL<SMT2PR7>
extern volatile __bit                   SMT2PR7             __at(0x28AF);	// @ (0x515 * 8 + 7)
#define                                 SMT2PR7_bit         _BIT_ACCESS(SMT2PRL,7)
// SMT2PRH<SMT2PR8>
extern volatile __bit                   SMT2PR8             __at(0x28B0);	// @ (0x516 * 8 + 0)
#define                                 SMT2PR8_bit         _BIT_ACCESS(SMT2PRH,0)
// SMT2PRH<SMT2PR9>
extern volatile __bit                   SMT2PR9             __at(0x28B1);	// @ (0x516 * 8 + 1)
#define                                 SMT2PR9_bit         _BIT_ACCESS(SMT2PRH,1)
// PIE8<SMT2PRAIE>
extern volatile __bit                   SMT2PRAIE           __at(0x38F4);	// @ (0x71E * 8 + 4)
#define                                 SMT2PRAIE_bit       _BIT_ACCESS(PIE8,4)
// PIR8<SMT2PRAIF>
extern volatile __bit                   SMT2PRAIF           __at(0x38A4);	// @ (0x714 * 8 + 4)
#define                                 SMT2PRAIF_bit       _BIT_ACCESS(PIR8,4)
// SMT2CON0<SMT2PS0>
extern volatile __bit                   SMT2PS0             __at(0x28C0);	// @ (0x518 * 8 + 0)
#define                                 SMT2PS0_bit         _BIT_ACCESS(SMT2CON0,0)
// SMT2CON0<SMT2PS1>
extern volatile __bit                   SMT2PS1             __at(0x28C1);	// @ (0x518 * 8 + 1)
#define                                 SMT2PS1_bit         _BIT_ACCESS(SMT2CON0,1)
// PIE8<SMT2PWAIE>
extern volatile __bit                   SMT2PWAIE           __at(0x38F5);	// @ (0x71E * 8 + 5)
